//=============================================================================
//
// プレイヤー処理 [editor.h]
// Author : GP11B132 31 PINTO OMER
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// 構造体定義
//*****************************************************************************

struct EDITOR
{
	XMFLOAT3	pos;			// ポリゴンの座標
	float		w, h;			// 幅と高さ
	float		countAnim;		// アニメーションカウント
	int			patternAnim;	// アニメーションパターンナンバー
	int			texNo;			// テクスチャ番号

	XMFLOAT3	move;			// 移動速度

};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitEditor(void);
void UninitEditor(void);
void UpdateEditor(void);
void DrawEditor(void);

EDITOR* GetEditor(void);


